{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Pepper bell Bacterial spot",
    "1": "Pepper bell healthy",
    "2": "Potato Early blight",
    "3": "Potato Late blight",
    "4": "Potato healthy",
    "5": "Tomato Bacterial spot",
    "6": "Tomato Early blight",
    "7": "Tomato Late blight",
    "8": "Tomato Leaf Mold",
    "9": "Tomato Septoria leaf spot",
    "10": "Tomato Spider mites Two spotted spider mite",
    "11": "Tomato Target Spot",
    "12": "Tomato YellowLeaf Curl Virus",
    "13": "Tomato healthy",
    "14": "Tomato mosaic virus"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Pepper bell Bacterial spot": 0,
    "Pepper bell healthy": 1,
    "Potato Early blight": 2,
    "Potato Late blight": 3,
    "Potato healthy": 4,
    "Tomato Bacterial spot": 5,
    "Tomato Early blight": 6,
    "Tomato Late blight": 7,
    "Tomato Leaf Mold": 8,
    "Tomato Septoria leaf spot": 9,
    "Tomato Spider mites Two spotted spider mite": 10,
    "Tomato Target Spot": 11,
    "Tomato YellowLeaf Curl Virus": 12,
    "Tomato healthy": 13,
    "Tomato mosaic virus": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.0"
}
